<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"azurerm","backend":"7cd4c9f326fca97f68329f5b46ff26ad6d494dc1202294c747ee2ba520893898","plan_job_ref":"Job Terraform PRs for Azure #11 at https://github.com/acm-uic/IaC/actions/runs/4401518509","plan_hash":"bd5cbcd8126f03ed63c158b784cff2a15876326c1753eff03e1df1982c11d16f","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan in __azure/terraform/stacks/acm-general__ in the __prod__ workspace
With var files: `azure/terraform/stacks/acm-general/configuration/prod.tfvars`
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azuread_application_password.terraform_sysadmin_demo will be created
  + resource "azuread_application_password" "terraform_sysadmin_demo" {
      + application_object_id = "************************************"
      + display_name          = "rbac-sysadmindemo-apppass"
      + end_date              = (known after apply)
      + end_date_relative     = "240h"
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # azuread_service_principal_password.terraform_sysadmin_demo will be destroyed
  # (because azuread_service_principal_password.terraform_sysadmin_demo is not in configuration)
  - resource "azuread_service_principal_password" "terraform_sysadmin_demo" {
      - display_name         = "rbac-sysadmindemo" -> null
      - end_date             = "2023-03-23T04:19:53Z" -> null
      - end_date_relative    = "240h" -> null
      - id                   = "99519fba-1292-4dbe-a41a-9937c0f5a0a6/password/4b662d53-9120-4de5-b221-5aa0b907aafc" -> null
      - key_id               = "4b662d53-9120-4de5-b221-5aa0b907aafc" -> null
      - service_principal_id = "99519fba-1292-4dbe-a41a-9937c0f5a0a6" -> null
      - start_date           = "2023-03-13T04:19:53Z" -> null
      - value                = (sensitive value)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform PRs for Azure #11](https://github.com/acm-uic/IaC/actions/runs/4401518509)